Revit 2024 API
FabricationService.IsValidButtonIndex Method
 Validates the button index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsValidButtonIndex(
	int paletteIndex,
	int buttonIndex
)
Visual Basic
Public Function IsValidButtonIndex ( _
	paletteIndex As Integer, _
	buttonIndex As Integer _
) As Boolean
Visual C++
public:
bool IsValidButtonIndex(
	int paletteIndex,
	int buttonIndex
)
Parameters
paletteIndex
Type: System.Int32
 The palette index.
buttonIndex
Type: System.Int32
 The button index to check.
Return Value
 True if larger or equal to 0 and less than PaletteCount.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace